Project/Toir.Adaptation/src/Reports/торо_ПланМТОТрудозатратИнструментов/торо_ПланМТОТрудозатратИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="dd7452d2-e1f3-4db3-9172-18c3f865d198">
  <name>торо_ПланМТОТрудозатратИнструментов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

Project/Toir.Adaptation/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_Ремонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГарантийныйРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c78bcaa2-754f-4a7f-9e89-f5a6e42d7594">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8cd050f-96b8-4025-804f-118eec0e9fd4">
    <name>гкс_ЭтоПереносРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ОтмененныеЗаявки/торо_ОтмененныеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ОтмененныеЗаявки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Заявка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="63eb186f-3d50-43ff-911a-18c004e7d600">
    <name>ИДРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ПлановыеМероприятия/торо_ПлановыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ПлановыеМероприятия</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>СписокОбъектов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_МаршрутыРегламентныхМероприятий/торо_МаршрутыРегламентныхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_МаршрутыРегламентныхМероприятий</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>СписокОбъектов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВерсииТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="14bdc774-4023-4716-9f09-d781c7bbfaa3">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="b3a0ce45-03a8-440c-8d44-e71cbb504596">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e5c19e7b-9d94-485e-a787-06a5e549f3a3">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="7bae5f7e-d12f-42ac-85bb-ef8f585e5de0">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c494d197-1312-4754-a0ef-be70a3b0680e">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="105cd740-1f60-45e1-871c-adeecd291b0d">
  <name>КурсыВалют</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="4bd1cae4-d5b5-444e-9cf5-67a969714293">
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="95aec7d2-179b-4ea3-a3df-3d737b713564">
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="b1a330d7-9b88-44e9-aba6-41ce5e5e669c">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Reports/торо_ПланМТОТрудозатратИнструментов/ObjectModule.bsl
&ИзменениеИКонтроль("ПолучитьСодержательнуюЧастьЗапроса")
Функция Расш_гкс_ПолучитьСодержательнуюЧастьЗапроса()

	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_Ремонты.Регистратор КАК Смета,
	|	торо_Ремонты.ID КАК ID,
	|	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_Ремонты.ВидРемонта КАК ВидРемонта,
	#Удаление
	|	торо_Ремонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончанияПлан
	#КонецУдаления
	#Вставка
	|	ЕстьNull(ТЧДат.ДатаНачала, торо_Ремонты.ДатаНачалаПлан) КАК ДатаНачалаПлан,
	|	ЕстьNull(ТЧДат.ДатаОкончания, торо_Ремонты.ДатаОкончанияПлан) КАК ДатаОкончанияПлан
	#КонецВставки
	|ПОМЕСТИТЬ ВТ_ВсеРемонтыПоЗаявкам
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	#Вставка
	|	Левое соединение РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК ТЧДат
	|	По ТЧДат.IDРемонта = торо_Ремонты.ID
	#КонецВставки
	|ГДЕ
	|	торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт
	|	И торо_Ремонты.Активность = ИСТИНА
	#Удаление
	|{ГДЕ
	|	(торо_Ремонты.ДатаНачалаПлан <= &ОкончаниеПериода),
	|	(торо_Ремонты.ДатаОкончанияПлан >= &НачалоПериода)}
	#КонецУдаления
	#Вставка
	|{ГДЕ
	|	(ЕстьNull(ТЧДат.ДатаНачала, торо_Ремонты.ДатаНачалаПлан) <= &ОкончаниеПериода),
	|	(ЕстьNull(ТЧДат.ДатаОкончания, торо_Ремонты.ДатаОкончанияПлан) >= &НачалоПериода)}
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Смета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ВсеРемонтыПоЗаявкам.Смета КАК Смета,
	|	ВТ_ВсеРемонтыПоЗаявкам.ID КАК ID,
	|	ВТ_ВсеРемонтыПоЗаявкам.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_ВсеРемонтыПоЗаявкам.ВидРемонта КАК ВидРемонта,
	|	ВТ_ВсеРемонтыПоЗаявкам.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ВТ_ВсеРемонтыПоЗаявкам.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	|	торо_ОтмененныеЗаявки.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_РемонтыПоЗаявкам
	|ИЗ
	|	ВТ_ВсеРемонтыПоЗаявкам КАК ВТ_ВсеРемонтыПоЗаявкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки
	|		ПО (торо_ОтмененныеЗаявки.Заявка = ВТ_ВсеРемонтыПоЗаявкам.Смета)
	|			И (торо_ОтмененныеЗаявки.ИДРемонта = ВТ_ВсеРемонтыПоЗаявкам.ID)
	|ГДЕ
	|	торо_ОтмененныеЗаявки.НомерСтроки ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПланГрафикРемонта.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПланГрафикРемонта.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПланГрафикРемонта.Регистратор КАК ДокППР,
	|	торо_ПланГрафикРемонта.ID КАК ID,
	#Удаление
	|	торо_ПланГрафикРемонта.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПланГрафикРемонта.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот
	#КонецУдаления
	#Вставка
	|	ЕстьNull(ТЧДат.ДатаНачала, торо_ПланГрафикРемонта.ДатаНачалаРемонтныхРабот) КАК ДатаНачалаРемонтныхРабот,
	|	ЕстьNull(ТЧДат.ДатаОкончания, торо_ПланГрафикРемонта.ДатаОкончанияРемонтныхРабот) КАК ДатаОкончанияРемонтныхРабот
	#КонецВставки
	|ПОМЕСТИТЬ ВТ_РемонтыПоППР
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, &РассчетППР = ИСТИНА {(Подразделение = &Подразделение)}) КАК торо_ПланГрафикРемонта
	#Вставка
	|	Левое соединение РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК ТЧДат
	|	По ТЧДат.IDРемонта = торо_ПланГрафикРемонта.ID
	#КонецВставки
	|ГДЕ
	|	НЕ торо_ПланГрафикРемонта.Отменен
	|	И НЕ торо_ПланГрафикРемонта.Замещен
	|{ГДЕ
	|	(торо_ПланГрафикРемонта.Исполнитель = &Исполнитель)}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеМероприятияСрезПоследних.СписокОбъектов КАК СписокОбъектов,
	|	торо_ПлановыеМероприятияСрезПоследних.ВидМероприятия КАК ВидМероприятия,
	#Удаление
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаНачала КАК ДатаНачала,
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	#КонецУдаления
	#Вставка
	|	ЕстьNull(ТЧДат.ДатаНачала, торо_ПлановыеМероприятияСрезПоследних.ДатаНачала) КАК ДатаНачала,
	|	ЕстьNull(ТЧДат.ДатаОкончания, торо_ПлановыеМероприятияСрезПоследних.ДатаОкончания) КАК ДатаОкончания,
	#КонецВставки
	|	торо_ПлановыеМероприятияСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ПлановыеМероприятияСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ПлановыеМероприятия
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(, &РассчетРеглМероприятий = ИСТИНА {(Подразделение = &Подразделение) }) КАК торо_ПлановыеМероприятияСрезПоследних
	#Вставка
	|	Левое соединение РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК ТЧДат
	|	По ТЧДат.IDРемонта = торо_ПлановыеМероприятияСрезПоследних.ID
	#КонецВставки
	|ГДЕ
	|	НЕ торо_ПлановыеМероприятияСрезПоследних.Отменен
	|{ГДЕ
	#Удаление
	|	(торо_ПлановыеМероприятияСрезПоследних.ДатаНачала <= &ОкончаниеПериода
	|			И торо_ПлановыеМероприятияСрезПоследних.ДатаНачала >= &НачалоПериода),
	#КонецУдаления
	#Вставка
	|	(ЕстьNull(ТЧДат.ДатаНачала, торо_ПлановыеМероприятияСрезПоследних.ДатаНачала) <= &ОкончаниеПериода
	|			И ЕстьNull(ТЧДат.ДатаНачала, торо_ПлановыеМероприятияСрезПоследних.ДатаНачала) >= &НачалоПериода),
	#КонецВставки
	|	(торо_ПлановыеМероприятияСрезПоследних.Исполнитель = &Исполнитель)}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СписокОбъектов,
	|	ВидМероприятия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ_РемонтыПоЗаявкам.ДатаНачалаПлан, ВТ_РемонтыПоППР.ДатаНачалаРемонтныхРабот) КАК ДатаРемонта,
	|	ВТ_РемонтыПоППР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВТ_РемонтыПоППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ЕСТЬNULL(ВТ_РемонтыПоЗаявкам.ДатаОкончанияПлан, ВТ_РемонтыПоППР.ДатаОкончанияРемонтныхРабот) КАК ДатаОкончания,
	|	ВТ_РемонтыПоППР.ДокППР КАК ДокППР,
	|	ВТ_РемонтыПоЗаявкам.Смета КАК Смета,
	|	ВТ_РемонтыПоППР.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ППРБезСмет
	|ИЗ
	|	ВТ_РемонтыПоППР КАК ВТ_РемонтыПоППР
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РемонтыПоЗаявкам КАК ВТ_РемонтыПоЗаявкам
	|		ПО ВТ_РемонтыПоППР.ID = ВТ_РемонтыПоЗаявкам.ID
	|			И (&РассчетСметПоППР = ИСТИНА)
	|ГДЕ
	|	ВТ_РемонтыПоЗаявкам.Смета ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонтныхРабот,
	|	ВидРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ВТ_РемонтыПоЗаявкам.ДатаНачалаПлан, ВТ_РемонтыПоППР.ДатаНачалаРемонтныхРабот) КАК ДатаРемонта,
	|	ВТ_РемонтыПоППР.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВТ_РемонтыПоППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ЕСТЬNULL(ВТ_РемонтыПоЗаявкам.ДатаОкончанияПлан, ВТ_РемонтыПоППР.ДатаОкончанияРемонтныхРабот) КАК ДатаОкончания,
	|	ВТ_РемонтыПоППР.ДокППР КАК ДокППР,
	|	ВТ_РемонтыПоЗаявкам.Смета КАК Смета,
	|	ВТ_РемонтыПоППР.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ППРСоСметами
	|ИЗ
	|	ВТ_РемонтыПоППР КАК ВТ_РемонтыПоППР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РемонтыПоЗаявкам КАК ВТ_РемонтыПоЗаявкам
	|		ПО (ВТ_РемонтыПоЗаявкам.ID = ВТ_РемонтыПоППР.ID)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	Смета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	#Удаление
	|	торо_Ремонты.ДатаНачалаПлан КАК ДатаРемонта,
	#КонецУдаления
	|	торо_Ремонты.ОбъектРемонта КАК Объект,
	|	торо_Ремонты.ВидРемонта КАК ВидРемонтныхРабот,
	#Удаление
	|	торо_Ремонты.ДатаОкончанияПлан КАК ДатаОкончания,
	#КонецУдаления
	#Вставка
	|	ЕстьNull(ТЧДат.ДатаНачала, торо_Ремонты.ДатаНачалаПлан) КАК ДатаРемонта,
	|	ЕстьNull(ТЧДат.ДатаОкончания, торо_Ремонты.ДатаОкончанияПлан) КАК ДатаОкончания,
	#КонецВставки
	|	NULL КАК ДокППР,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка КАК Смета,
	|	торо_Ремонты.ID КАК ID
	|ПОМЕСТИТЬ СписокЗаявокНаОснованииДефектовИВнешнихОснований
	|ИЗ
	|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК торо_Ремонты
	#Вставка
	|	Левое соединение РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК ТЧДат
	|	По ТЧДат.IDРемонта = торо_Ремонты.ID
	#КонецВставки
	|		ПО торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка = торо_Ремонты.Регистратор
	|			И торо_ЗаявкаНаРемонтРемонтыОборудования.ID = торо_Ремонты.ID
	|			И (&РассчетСметПоДефектам = ИСТИНА
	|					И ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтРемонтыОборудования.ДокументИсточник) = ТИП(Документ.торо_ВыявленныеДефекты)
	|				ИЛИ &РассчетСметПоВнешнимОснованиям = ИСТИНА
	|					И ТИПЗНАЧЕНИЯ(торо_ЗаявкаНаРемонтРемонтыОборудования.ДокументИсточник) = ТИП(Документ.торо_ВнешнееОснованиеДляРабот))
	|{ГДЕ
	#Вставка
	|	(ЕстьNull(ТЧДат.ДатаНачала, торо_Ремонты.ДатаНачалаПлан) <= &ОкончаниеПериода
	|			И ЕстьNull(ТЧДат.ДатаОкончания, торо_Ремонты.ДатаОкончанияПлан) >= &НачалоПериода),
	#КонецВставки
	#Удаление
	|	(торо_Ремонты.ДатаНачалаПлан <= &ОкончаниеПериода
	|			И торо_Ремонты.ДатаОкончанияПлан >= &НачалоПериода),
	#КонецУдаления
	|	(торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Подразделение = &Подразделение)}
	|
	|СГРУППИРОВАТЬ ПО
	#Удаление
	|	торо_Ремонты.ДатаНачалаПлан,
	#КонецУдаления
	|	торо_Ремонты.ОбъектРемонта,
	|	торо_Ремонты.ВидРемонта,
	#Удаление
	|	торо_Ремонты.ДатаОкончанияПлан,
	#КонецУдаления
	#Вставка
	|	ЕстьNull(ТЧДат.ДатаНачала, торо_Ремонты.ДатаНачалаПлан),
	|	ЕстьNull(ТЧДат.ДатаОкончания, торо_Ремонты.ДатаОкончанияПлан),
	#КонецВставки
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка,
	|	торо_Ремонты.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	Смета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ППРБезСмет.ДатаРемонта КАК ДатаРемонта,
	|	ВТ_ППРБезСмет.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВТ_ППРБезСмет.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК НормРемДляПольз,
	|	ВТ_ППРБезСмет.ДатаОкончания КАК ДатаОкончания,
	|	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
	|	ВТ_ППРБезСмет.ДокППР КАК ДокППР,
	|	ВТ_ППРБезСмет.Смета КАК Смета,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ППРБезСмет.ДатаРемонта, ДЕНЬ), КОНЕЦПЕРИОДА(ВТ_ППРБезСмет.ДатаОкончания, ДЕНЬ), ДЕНЬ) + 1 КАК КоличествоДней,
	|	ВТ_ППРБезСмет.ID КАК ID
	|ПОМЕСТИТЬ БазаОтчета_Ремонты_БезТехКарт
	|ИЗ
	|	ВТ_ППРБезСмет КАК ВТ_ППРБезСмет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|		ПО ВТ_ППРБезСмет.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	|			И ВТ_ППРБезСмет.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.Приоритет
	|{ГДЕ
	|	(ВТ_ППРБезСмет.ДатаРемонта <= &ОкончаниеПериода
	|			И ВТ_ППРБезСмет.ДатаРемонта >= &НачалоПериода)}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ППРБезСмет.ДатаРемонта,
	|	ВТ_ППРБезСмет.ОбъектРемонтныхРабот,
	|	ВТ_ППРБезСмет.ВидРемонтныхРабот,
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт,
	|	ВТ_ППРБезСмет.ДатаОкончания,
	|	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот,
	|	ВТ_ППРБезСмет.ДокППР,
	|	ВТ_ППРБезСмет.Смета,
	|	ВТ_ППРБезСмет.ID
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ПлановыеМероприятия.ДатаНачала,
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта,
	|	торо_ПлановыеМероприятия.ВидМероприятия,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.НормативныйРемонт,
	|	торо_ПлановыеМероприятия.ДатаОкончания,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.ГрафикРемонтныхРабот,
	|	торо_ПлановыеМероприятия.Регистратор,
	|	NULL,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(торо_ПлановыеМероприятия.ДатаНачала, ДЕНЬ), КОНЕЦПЕРИОДА(торо_ПлановыеМероприятия.ДатаОкончания, ДЕНЬ), ДЕНЬ) + 1,
	|	торо_ПлановыеМероприятия.ID
	|ИЗ
	|	ВТ_ПлановыеМероприятия КАК торо_ПлановыеМероприятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|		ПО торо_ПлановыеМероприятия.СписокОбъектов = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_РегламентныеМероприятияИСпискиОбъектов
	|		ПО торо_ПлановыеМероприятия.СписокОбъектов = торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов
	|			И торо_ПлановыеМероприятия.ВидМероприятия = торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НормРемДляПольз,
	|	ГрафикРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(торо_ВерсииТехКарт.Период) КАК Период,
	|	торо_ВерсииТехКарт.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
	|	БазаОтчета_Ремонты_БезТехКарт.ДатаРемонта КАК ДатаРемонта,
	|	БазаОтчета_Ремонты_БезТехКарт.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	БазаОтчета_Ремонты_БезТехКарт.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	БазаОтчета_Ремонты_БезТехКарт.НормРемДляПольз КАК НормРемДляПольз,
	|	БазаОтчета_Ремонты_БезТехКарт.ДатаОкончания КАК ДатаОкончания,
	|	БазаОтчета_Ремонты_БезТехКарт.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
	|	БазаОтчета_Ремонты_БезТехКарт.ДокППР КАК ДокППР,
	|	БазаОтчета_Ремонты_БезТехКарт.Смета КАК Смета,
	|	БазаОтчета_Ремонты_БезТехКарт.КоличествоДней КАК КоличествоДней,
	|	БазаОтчета_Ремонты_БезТехКарт.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ДляСрезаВерсийТК
	|ИЗ
	|	РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазаОтчета_Ремонты_БезТехКарт КАК БазаОтчета_Ремонты_БезТехКарт
	|		ПО торо_ВерсииТехКарт.ИдентификаторТехКарты = БазаОтчета_Ремонты_БезТехКарт.НормРемДляПольз
	|			И (БазаОтчета_Ремонты_БезТехКарт.ДатаРемонта > торо_ВерсииТехКарт.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ВерсииТехКарт.ИдентификаторТехКарты,
	|	БазаОтчета_Ремонты_БезТехКарт.ДатаРемонта,
	|	БазаОтчета_Ремонты_БезТехКарт.ОбъектРемонтныхРабот,
	|	БазаОтчета_Ремонты_БезТехКарт.ВидРемонтныхРабот,
	|	БазаОтчета_Ремонты_БезТехКарт.НормРемДляПольз,
	|	БазаОтчета_Ремонты_БезТехКарт.ДатаОкончания,
	|	БазаОтчета_Ремонты_БезТехКарт.ГрафикРемонтныхРабот,
	|	БазаОтчета_Ремонты_БезТехКарт.ДокППР,
	|	БазаОтчета_Ремонты_БезТехКарт.Смета,
	|	БазаОтчета_Ремонты_БезТехКарт.КоличествоДней,
	|	БазаОтчета_Ремонты_БезТехКарт.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторТехКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ДляСрезаВерсийТК.Период КАК Период,
	|	ВТ_ДляСрезаВерсийТК.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
	|	ВТ_ДляСрезаВерсийТК.ДатаРемонта КАК ДатаРемонта,
	|	ВТ_ДляСрезаВерсийТК.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВТ_ДляСрезаВерсийТК.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ВТ_ДляСрезаВерсийТК.НормРемДляПольз КАК НормРемДляПольз,
	|	ВТ_ДляСрезаВерсийТК.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ДляСрезаВерсийТК.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
	|	ВТ_ДляСрезаВерсийТК.ДокППР КАК ДокППР,
	|	ВТ_ДляСрезаВерсийТК.Смета КАК Смета,
	|	ВТ_ДляСрезаВерсийТК.КоличествоДней КАК КоличествоДней,
	|	ВТ_ДляСрезаВерсийТК.ID КАК ID,
	|	торо_ВерсииТехКарт.ТехКарта КАК НормативныйРемонт
	|ПОМЕСТИТЬ БазаОтчета_Ремонты
	|ИЗ
	|	ВТ_ДляСрезаВерсийТК КАК ВТ_ДляСрезаВерсийТК
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|		ПО ВТ_ДляСрезаВерсийТК.Период = торо_ВерсииТехКарт.Период
	|			И ВТ_ДляСрезаВерсийТК.ИдентификаторТехКарты = торо_ВерсииТехКарт.ИдентификаторТехКарты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НормРемДляПольз,
	|	ГрафикРемонтныхРабот,
	|	НормативныйРемонт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БазаОтчета_Ремонты.ДатаРемонта КАК ДатаРемонта,
	|	БазаОтчета_Ремонты.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	БазаОтчета_Ремонты.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	БазаОтчета_Ремонты.ДатаОкончания КАК ДатаОкончания,
	|	БазаОтчета_Ремонты.ДокППР КАК ДокППР,
	|	БазаОтчета_Ремонты.НормативныйРемонт КАК НормативныйРемонт,
	|	БазаОтчета_Ремонты.НормРемДляПольз КАК НормРемДляПольз,
	|	БазаОтчета_Ремонты.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
	|	БазаОтчета_Ремонты.Смета КАК Смета,
	|	торо_Состав.Состав КАК ТехКарта,
	|	торо_Состав.Количество КАК Количество,
	|	БазаОтчета_Ремонты.КоличествоДней КАК КоличествоДней,
	|	БазаОтчета_Ремонты.ID КАК ID
	|ПОМЕСТИТЬ БазаОтчета
	|ИЗ
	|	БазаОтчета_Ремонты КАК БазаОтчета_Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_Состав
	|		ПО БазаОтчета_Ремонты.НормативныйРемонт = торо_Состав.ТехКарта
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	БазаОтчета_Ремонты.ДатаРемонта,
	|	БазаОтчета_Ремонты.ОбъектРемонтныхРабот,
	|	БазаОтчета_Ремонты.ВидРемонтныхРабот,
	|	БазаОтчета_Ремонты.ДатаОкончания,
	|	БазаОтчета_Ремонты.ДокППР,
	|	БазаОтчета_Ремонты.НормативныйРемонт,
	|	БазаОтчета_Ремонты.НормРемДляПольз,
	|	БазаОтчета_Ремонты.ГрафикРемонтныхРабот,
	|	БазаОтчета_Ремонты.Смета,
	|	БазаОтчета_Ремонты.НормативныйРемонт,
	|	1,
	|	БазаОтчета_Ремонты.КоличествоДней,
	|	БазаОтчета_Ремонты.ID
	|ИЗ
	|	БазаОтчета_Ремонты КАК БазаОтчета_Ремонты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТехКарта,
	|	ОбъектРемонтныхРабот,
	|	ВидРемонтныхРабот,
	|	Смета,
	|	ГрафикРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НормативныеРемонты.ДатаРемонта КАК Период,
	|	НормативныеРемонты.ДокППР КАК Документ,
	|	торо_РемонтыМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	торо_РемонтыМатериальныеЗатраты.Характеристика КАК Характеристика,
	|	торо_РемонтыМатериальныеЗатраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(торо_РемонтыМатериальныеЗатраты.Количество * НормативныеРемонты.Количество) КАК Количество,
	|	НормативныеРемонты.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	НормативныеРемонты.ВидРемонтныхРабот КАК ВидРемонта,
	|	НормативныеРемонты.ID КАК ID
	|ПОМЕСТИТЬ ТабНоменклатурыПоППРБезСмет
	|ИЗ
	|	Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_РемонтыМатериальныеЗатраты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазаОтчета КАК НормативныеРемонты
	|		ПО торо_РемонтыМатериальныеЗатраты.Ссылка = НормативныеРемонты.ТехКарта
	|			И (НормативныеРемонты.Смета ЕСТЬ NULL)
	|
	|СГРУППИРОВАТЬ ПО
	|	НормативныеРемонты.ДатаРемонта,
	|	торо_РемонтыМатериальныеЗатраты.Номенклатура,
	|	торо_РемонтыМатериальныеЗатраты.Характеристика,
	|	НормативныеРемонты.ДокППР,
	|	торо_РемонтыМатериальныеЗатраты.ЕдиницаИзмерения,
	|	НормативныеРемонты.ОбъектРемонтныхРабот,
	|	НормативныеРемонты.ВидРемонтныхРабот,
	|	НормативныеРемонты.ID
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НормативныеРемонты.ДатаРемонта,
	|	НормативныеРемонты.ДокППР,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура.ЕдиницаИзмерения,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Количество,
	|	НормативныеРемонты.ОбъектРемонтныхРабот,
	|	НормативныеРемонты.ВидРемонтныхРабот,
	|	НормативныеРемонты.ID
	|ИЗ
	|	БазаОтчета_Ремонты КАК НормативныеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
	|		ПО НормативныеРемонты.ОбъектРемонтныхРабот = торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта
	|			И НормативныеРемонты.ВидРемонтныхРабот = торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта
	|			И (НормативныеРемонты.Смета ЕСТЬ NULL)
	|			И (торо_НормыЗапчастейНаОбъектыРемонта.Приоритет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабНоменклатуры.Период КАК Период,
	|	ТабНоменклатуры.Документ КАК Документ,
	|	ТабНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТабНоменклатуры.Характеристика КАК Характеристика,
	|	ТабНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТабНоменклатуры.Количество КАК Количество,
	|	ТабНоменклатуры.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ТабНоменклатуры.ВидРемонта КАК ВидРемонта,
	|	NULL КАК ДатаОкончания,
	|	ТабНоменклатуры.Документ КАК ДокППР,
	|	ТабНоменклатуры.ID КАК ID
	|ПОМЕСТИТЬ НоменклатураКоличество
	|ИЗ
	|	ТабНоменклатурыПоППРБезСмет КАК ТабНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БазаОтчета.ДатаРемонта,
	|	БазаОтчета.Смета,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура.ЕдиницаИзмерения,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Количество,
	|	БазаОтчета.ОбъектРемонтныхРабот,
	|	БазаОтчета.ВидРемонтныхРабот,
	|	NULL,
	|	БазаОтчета.ДокППР,
	|	БазаОтчета.ID
	|ИЗ
	|	БазаОтчета КАК БазаОтчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеМатериальныеЗатратыРемонтныхРабот КАК торо_ПлановыеМатериальныеЗатратыРемонтныхРабот
	|		ПО БазаОтчета.Смета = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Регистратор
	|			И БазаОтчета.ID = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БазаОтчета.ДатаРемонта,
	|	БазаОтчета.Смета,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура,
	|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура.ЕдиницаИзмерения,
	|	торо_ПлановыеЗатратыЗапчастей.Количество,
	|	БазаОтчета.ОбъектРемонтныхРабот,
	|	БазаОтчета.ВидРемонтныхРабот,
	|	NULL,
	|	БазаОтчета.ДокППР,
	|	БазаОтчета.ID
	|ИЗ
	|	БазаОтчета КАК БазаОтчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеЗатратыЗапчастей КАК торо_ПлановыеЗатратыЗапчастей
	|		ПО БазаОтчета.Смета = торо_ПлановыеЗатратыЗапчастей.Регистратор
	|			И БазаОтчета.ID = торо_ПлановыеЗатратыЗапчастей.РемонтыОборудования_ID
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаРемонта,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Смета,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура.ЕдиницаИзмерения,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Количество,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Объект,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ВидРемонтныхРабот,
	|	NULL,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДокППР,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ID
	|ИЗ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований КАК СписокЗаявокНаОснованииДефектовИВнешнихОснований
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеМатериальныеЗатратыРемонтныхРабот КАК торо_ПлановыеМатериальныеЗатратыРемонтныхРабот
	|		ПО СписокЗаявокНаОснованииДефектовИВнешнихОснований.ID = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID
	|			И СписокЗаявокНаОснованииДефектовИВнешнихОснований.Смета = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаРемонта,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Смета,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура,
	|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура.ЕдиницаИзмерения,
	|	торо_ПлановыеЗатратыЗапчастей.Количество,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Объект,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ВидРемонтныхРабот,
	|	NULL,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДокППР,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ID
	|ИЗ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований КАК СписокЗаявокНаОснованииДефектовИВнешнихОснований
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеЗатратыЗапчастей КАК торо_ПлановыеЗатратыЗапчастей
	|		ПО СписокЗаявокНаОснованииДефектовИВнешнихОснований.ID = торо_ПлановыеЗатратыЗапчастей.РемонтыОборудования_ID
	|			И СписокЗаявокНаОснованииДефектовИВнешнихОснований.Смета = торо_ПлановыеЗатратыЗапчастей.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ППРСоСметами.ДатаРемонта,
	|	ВТ_ППРСоСметами.Смета,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура.ЕдиницаИзмерения,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Количество,
	|	ВТ_ППРСоСметами.ОбъектРемонтныхРабот,
	|	ВТ_ППРСоСметами.ВидРемонтныхРабот,
	|	NULL,
	|	ВТ_ППРСоСметами.ДокППР,
	|	ВТ_ППРСоСметами.ID
	|ИЗ
	|	ВТ_ППРСоСметами КАК ВТ_ППРСоСметами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеМатериальныеЗатратыРемонтныхРабот КАК торо_ПлановыеМатериальныеЗатратыРемонтныхРабот
	|		ПО ВТ_ППРСоСметами.ID = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID
	|			И ВТ_ППРСоСметами.Смета = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ППРСоСметами.ДатаРемонта,
	|	ВТ_ППРСоСметами.Смета,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура,
	|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура.ЕдиницаИзмерения,
	|	торо_ПлановыеЗатратыЗапчастей.Количество,
	|	ВТ_ППРСоСметами.ОбъектРемонтныхРабот,
	|	ВТ_ППРСоСметами.ВидРемонтныхРабот,
	|	NULL,
	|	ВТ_ППРСоСметами.ДокППР,
	|	ВТ_ППРСоСметами.ID
	|ИЗ
	|	ВТ_ППРСоСметами КАК ВТ_ППРСоСметами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеЗатратыЗапчастей КАК торо_ПлановыеЗатратыЗапчастей
	|		ПО ВТ_ППРСоСметами.ID = торо_ПлановыеЗатратыЗапчастей.РемонтыОборудования_ID
	|			И ВТ_ППРСоСметами.Смета = торо_ПлановыеЗатратыЗапчастей.Регистратор
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураКоличество.Период КАК Период,
	|	НоменклатураКоличество.Документ КАК Документ,
	|	НоменклатураКоличество.Номенклатура КАК Номенклатура,
	|	НоменклатураКоличество.Характеристика КАК Характеристика,
	|	НоменклатураКоличество.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(НоменклатураКоличество.Количество) КАК Количество,
	|	НоменклатураКоличество.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	НоменклатураКоличество.ВидРемонта КАК ВидРемонта,
	|	НоменклатураКоличество.ДатаОкончания КАК ДатаОкончания,
	|	НоменклатураКоличество.ДокППР КАК ДокППР,
	|	НоменклатураКоличество.ID КАК ID
	|ПОМЕСТИТЬ ВТ_СгруппированнаяНоменклатура
	|ИЗ
	|	НоменклатураКоличество КАК НоменклатураКоличество
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураКоличество.Период,
	|	НоменклатураКоличество.Документ,
	|	НоменклатураКоличество.Номенклатура,
	|	НоменклатураКоличество.Характеристика,
	|	НоменклатураКоличество.ЕдиницаИзмерения,
	|	НоменклатураКоличество.ОбъектРемонтныхРабот,
	|	НоменклатураКоличество.ВидРемонта,
	|	НоменклатураКоличество.ДатаОкончания,
	|	НоменклатураКоличество.ДокППР,
	|	НоменклатураКоличество.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_СгруппированнаяНоменклатура.Период КАК Период,
	|	ВТ_СгруппированнаяНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТ_СгруппированнаяНоменклатура.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК ПериодЦена,
	|	ЦеныНоменклатуры.ВидЦены КАК ТипЦен,
	|	ЦеныНоменклатуры.Валюта КАК Валюта
	|ПОМЕСТИТЬ НоменклатураПериодЦен
	|ИЗ
	|	ВТ_СгруппированнаяНоменклатура КАК ВТ_СгруппированнаяНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|			ПО ЦеныНоменклатуры.ВидЦены = Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта
	|		ПО ВТ_СгруппированнаяНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ВТ_СгруппированнаяНоменклатура.Характеристика = ЦеныНоменклатуры.Характеристика
	|			И ВТ_СгруппированнаяНоменклатура.Период >= ЦеныНоменклатуры.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СгруппированнаяНоменклатура.Период,
	|	ВТ_СгруппированнаяНоменклатура.Номенклатура,
	|	ВТ_СгруппированнаяНоменклатура.Характеристика,
	|	ЦеныНоменклатуры.ВидЦены,
	|	ЦеныНоменклатуры.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ПериодЦена,
	|	ТипЦен,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_СгруппированнаяНоменклатура.Период КАК Период,
	|	ВТ_СгруппированнаяНоменклатура.Документ КАК Документ,
	|	ВТ_СгруппированнаяНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТ_СгруппированнаяНоменклатура.Характеристика КАК Характеристика,
	|	ВТ_СгруппированнаяНоменклатура.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВТ_СгруппированнаяНоменклатура.ВидРемонта КАК ВидРемонта,
	|	ВТ_СгруппированнаяНоменклатура.Количество КАК Количество,
	|	ВТ_СгруппированнаяНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныНоменклатуры.ВидЦены КАК ТипЦен,
	|	ЦеныНоменклатуры.Валюта КАК Валюта,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ВТ_СгруппированнаяНоменклатура.ID КАК ID
	|ПОМЕСТИТЬ НоменклатураЦеныВалюта
	|ИЗ
	|	ВТ_СгруппированнаяНоменклатура КАК ВТ_СгруппированнаяНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураПериодЦен КАК НоменклатураПериодЦен
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|			ПО НоменклатураПериодЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|				И НоменклатураПериодЦен.Характеристика = ЦеныНоменклатуры.Характеристика
	|				И НоменклатураПериодЦен.ПериодЦена = ЦеныНоменклатуры.Период
	|				И НоменклатураПериодЦен.ТипЦен = ЦеныНоменклатуры.ВидЦены
	|				И НоменклатураПериодЦен.Валюта = ЦеныНоменклатуры.Валюта
	|		ПО ВТ_СгруппированнаяНоменклатура.Период = НоменклатураПериодЦен.Период
	|			И ВТ_СгруппированнаяНоменклатура.Номенклатура = НоменклатураПериодЦен.Номенклатура
	|			И ВТ_СгруппированнаяНоменклатура.Характеристика = НоменклатураПериодЦен.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеВалюта.Документ КАК Документ,
	|	ДанныеВалюта.Номенклатура КАК Номенклатура,
	|	ДанныеВалюта.Характеристика КАК Характеристика,
	|	ДанныеВалюта.Валюта КАК Валюта,
	|	МАКСИМУМ(КурсыВалют.Период) КАК ДатаРегистр,
	|	ДанныеВалюта.Период КАК Период,
	|	ДанныеВалюта.ID КАК ID
	|ПОМЕСТИТЬ ДатаРегистраКурсов
	|ИЗ
	|	НоменклатураЦеныВалюта КАК ДанныеВалюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ДанныеВалюта.Валюта = КурсыВалют.Валюта
	|			И ДанныеВалюта.Период >= КурсыВалют.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеВалюта.Документ,
	|	ДанныеВалюта.Номенклатура,
	|	ДанныеВалюта.Характеристика,
	|	ДанныеВалюта.Валюта,
	|	ДанныеВалюта.Период,
	|	ДанныеВалюта.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДатаРегистраКурсов.Документ КАК Документ,
	|	ДатаРегистраКурсов.Номенклатура КАК Номенклатура,
	|	ДатаРегистраКурсов.Характеристика КАК Характеристика,
	|	ДатаРегистраКурсов.Период КАК Период,
	|	ДатаРегистраКурсов.Валюта КАК Валюта,
	|	ЕСТЬNULL(КурсыВалют.Курс, 0) КАК Курс,
	|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК Кратность,
	|	ДатаРегистраКурсов.ID КАК ID
	|ПОМЕСТИТЬ ТабКурсыВалют
	|ИЗ
	|	ДатаРегистраКурсов КАК ДатаРегистраКурсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ДатаРегистраКурсов.Валюта = КурсыВалют.Валюта
	|			И ДатаРегистраКурсов.ДатаРегистр = КурсыВалют.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураКоличество.Период КАК Период,
	|	НоменклатураКоличество.Документ КАК Документ,
	|	НоменклатураКоличество.Номенклатура КАК Номенклатура,
	|	НоменклатураКоличество.Характеристика КАК Характеристика,
	|	НоменклатураКоличество.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	НоменклатураКоличество.ВидРемонта КАК ВидРемонта,
	|	НоменклатураКоличество.Номенклатура.Артикул КАК Артикул,
	|	СУММА(НоменклатураКоличество.Количество) КАК Количество,
	|	НоменклатураКоличество.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(НоменклатураКоличество.Количество * НоменклатураКоличество.Цена * ТабКурсыВалют.Курс / ТабКурсыВалют.Кратность) КАК Сумма
	|ПОМЕСТИТЬ ТабМТО
	|ИЗ
	|	НоменклатураЦеныВалюта КАК НоменклатураКоличество
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабКурсыВалют КАК ТабКурсыВалют
	|		ПО НоменклатураКоличество.Номенклатура = ТабКурсыВалют.Номенклатура
	|			И НоменклатураКоличество.Характеристика = ТабКурсыВалют.Характеристика
	|			И НоменклатураКоличество.Период = ТабКурсыВалют.Период
	|			И НоменклатураКоличество.Валюта = ТабКурсыВалют.Валюта
	|			И НоменклатураКоличество.Документ = ТабКурсыВалют.Документ
	|			И НоменклатураКоличество.ID = ТабКурсыВалют.ID
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураКоличество.Номенклатура,
	|	НоменклатураКоличество.Характеристика,
	|	НоменклатураКоличество.ОбъектРемонтныхРабот,
	|	НоменклатураКоличество.ВидРемонта,
	|	НоменклатураКоличество.Документ,
	|	НоменклатураКоличество.ЕдиницаИзмерения,
	|	НоменклатураКоличество.Номенклатура.Артикул,
	|	НоменклатураКоличество.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БазаОтчета.ДатаРемонта КАК ДатаРемонта,
	|	БазаОтчета.ДатаОкончания КАК ДатаОкончания,
	|	БазаОтчета.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот
	|ПОМЕСТИТЬ ВТ_ОграниченияКалендарныеГрафики
	|ИЗ
	|	БазаОтчета КАК БазаОтчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаРемонта,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаОкончания,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Объект.ПлановыйГрафикРаботы
	|ИЗ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований КАК СписокЗаявокНаОснованииДефектовИВнешнихОснований
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ОграниченияКалендарныеГрафики.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
	|	МИНИМУМ(ВТ_ОграниченияКалендарныеГрафики.ДатаРемонта) КАК ДатаРемонта,
	|	МАКСИМУМ(ВТ_ОграниченияКалендарныеГрафики.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ОграниченияКалендаря
	|ИЗ
	|	ВТ_ОграниченияКалендарныеГрафики КАК ВТ_ОграниченияКалендарныеГрафики
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОграниченияКалендарныеГрафики.ГрафикРемонтныхРабот
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикРемонтныхРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КалендарныеГрафики.Календарь КАК Календарь,
	|	КалендарныеГрафики.Год КАК Год,
	|	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика,
	|	КалендарныеГрафики.ДеньВключенВГрафик КАК ДеньВключенВГрафик,
	|	КалендарныеГрафики.КоличествоДнейВГрафикеСНачалаГода КАК КоличествоДнейВГрафикеСНачалаГода
	|ПОМЕСТИТЬ ВТ_КалендарныеГрафики
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОграниченияКалендаря КАК ВТ_ОграниченияКалендаря
	|		ПО КалендарныеГрафики.Календарь = ВТ_ОграниченияКалендаря.ГрафикРемонтныхРабот
	|			И (КалендарныеГрафики.ДатаГрафика >= НАЧАЛОПЕРИОДА(ВТ_ОграниченияКалендаря.ДатаРемонта, ДЕНЬ))
	|			И (КалендарныеГрафики.ДатаГрафика <= НАЧАЛОПЕРИОДА(ВТ_ОграниченияКалендаря.ДатаОкончания, ДЕНЬ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Календарь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БазаОтчета.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	БазаОтчета.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_РемонтыИнструментыИТехника.Инструмент КАК Инструмент,
	|	КалендарныеГрафики.ДатаГрафика КАК Дата,
	|	СУММА(торо_РемонтыИнструментыИТехника.Количество * БазаОтчета.Количество) КАК КоличествоИнструменты,
	|	МАКСИМУМ(торо_РемонтыИнструментыИТехника.Количество * БазаОтчета.Количество) КАК МаксимальнаяПотребностьИнструменты,
	|	БазаОтчета.ДокППР КАК ПланГрафикИнструменты,
	|	БазаОтчета.НормРемДляПольз КАК НормативныйРемонтИнструменты,
	|	БазаОтчета.Смета КАК СметаИнструменты
	|ПОМЕСТИТЬ ТабИнструментов
	|ИЗ
	|	ВТ_КалендарныеГрафики КАК КалендарныеГрафики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазаОтчета КАК БазаОтчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.ИнструментыИТехника КАК торо_РемонтыИнструментыИТехника
	|			ПО БазаОтчета.ТехКарта = торо_РемонтыИнструментыИТехника.Ссылка
	|		ПО (БазаОтчета.ГрафикРемонтныхРабот = КалендарныеГрафики.Календарь)
	|			И (КалендарныеГрафики.ДатаГрафика >= НАЧАЛОПЕРИОДА(БазаОтчета.ДатаРемонта, ДЕНЬ))
	|			И (КалендарныеГрафики.ДатаГрафика <= НАЧАЛОПЕРИОДА(БазаОтчета.ДатаОкончания, ДЕНЬ))
	|ГДЕ
	|	БазаОтчета.Смета ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	БазаОтчета.ОбъектРемонтныхРабот,
	|	БазаОтчета.ВидРемонтныхРабот,
	|	торо_РемонтыИнструментыИТехника.Инструмент,
	|	торо_РемонтыИнструментыИТехника.Количество,
	|	КалендарныеГрафики.ДатаГрафика,
	|	БазаОтчета.ДокППР,
	|	БазаОтчета.НормРемДляПольз,
	|	БазаОтчета.Смета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БазаОтчета.ОбъектРемонтныхРабот,
	|	БазаОтчета.ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент,
	|	КалендарныеГрафики.ДатаГрафика,
	|	СУММА(торо_ЗаявкаНаРемонтИнструменты.Количество),
	|	МАКСИМУМ(торо_ЗаявкаНаРемонтИнструменты.Количество),
	|	БазаОтчета.ДокППР,
	|	БазаОтчета.НормРемДляПольз,
	|	БазаОтчета.Смета
	|ИЗ
	|	ВТ_КалендарныеГрафики КАК КалендарныеГрафики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазаОтчета КАК БазаОтчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.Инструменты КАК торо_ЗаявкаНаРемонтИнструменты
	|			ПО БазаОтчета.Смета = торо_ЗаявкаНаРемонтИнструменты.Ссылка
	|				И БазаОтчета.ID = торо_ЗаявкаНаРемонтИнструменты.РемонтыОборудования_ID
	|		ПО (БазаОтчета.ГрафикРемонтныхРабот = КалендарныеГрафики.Календарь)
	|			И (КалендарныеГрафики.ДатаГрафика >= НАЧАЛОПЕРИОДА(БазаОтчета.ДатаРемонта, ДЕНЬ))
	|			И (КалендарныеГрафики.ДатаГрафика <= НАЧАЛОПЕРИОДА(БазаОтчета.ДатаОкончания, ДЕНЬ))
	|ГДЕ
	|	НЕ БазаОтчета.Смета ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	БазаОтчета.ОбъектРемонтныхРабот,
	|	БазаОтчета.ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент,
	|	торо_ЗаявкаНаРемонтИнструменты.Количество,
	|	КалендарныеГрафики.ДатаГрафика,
	|	БазаОтчета.ДокППР,
	|	БазаОтчета.НормРемДляПольз,
	|	БазаОтчета.Смета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Объект,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент,
	|	КалендарныеГрафики.ДатаГрафика,
	|	торо_ЗаявкаНаРемонтИнструменты.Количество,
	|	МАКСИМУМ(торо_ЗаявкаНаРемонтИнструменты.Количество),
	|	NULL,
	|	NULL,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Смета
	|ИЗ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований КАК СписокЗаявокНаОснованииДефектовИВнешнихОснований
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КалендарныеГрафики КАК КалендарныеГрафики
	|		ПО СписокЗаявокНаОснованииДефектовИВнешнихОснований.Объект.ПлановыйГрафикРаботы = КалендарныеГрафики.Календарь
	|			И (КалендарныеГрафики.ДатаГрафика >= НАЧАЛОПЕРИОДА(СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаРемонта, ДЕНЬ))
	|			И (КалендарныеГрафики.ДатаГрафика <= НАЧАЛОПЕРИОДА(СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаОкончания, ДЕНЬ))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.Инструменты КАК торо_ЗаявкаНаРемонтИнструменты
	|		ПО СписокЗаявокНаОснованииДефектовИВнешнихОснований.Смета = торо_ЗаявкаНаРемонтИнструменты.Ссылка
	|			И СписокЗаявокНаОснованииДефектовИВнешнихОснований.ID = торо_ЗаявкаНаРемонтИнструменты.РемонтыОборудования_ID
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Объект,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонтИнструменты.Инструмент,
	|	КалендарныеГрафики.ДатаГрафика,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Смета,
	|	торо_ЗаявкаНаРемонтИнструменты.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БазаОтчета.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	БазаОтчета.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	КалендарныеГрафики.ДатаГрафика КАК Дата,
	|	торо_РемонтыТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	торо_РемонтыТрудовыеЗатраты.Количество КАК КоличествоСотрудники,
	|	НАЧАЛОПЕРИОДА(КалендарныеГрафики.ДатаГрафика, МЕСЯЦ) КАК Период,
	|	торо_РемонтыТрудовыеЗатраты.Количество КАК МаксимальнаяПотребностьСотрудники,
	|	СУММА(торо_РемонтыТрудовыеЗатраты.ВремяРаботы * торо_РемонтыТрудовыеЗатраты.Количество / БазаОтчета.КоличествоДней) КАК ВремяРаботы
	|ПОМЕСТИТЬ ТабСотрудников
	|ИЗ
	|	ВТ_КалендарныеГрафики КАК КалендарныеГрафики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазаОтчета КАК БазаОтчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.ТрудовыеЗатраты КАК торо_РемонтыТрудовыеЗатраты
	|			ПО БазаОтчета.ТехКарта = торо_РемонтыТрудовыеЗатраты.Ссылка
	|		ПО (БазаОтчета.ГрафикРемонтныхРабот = КалендарныеГрафики.Календарь)
	|			И (КалендарныеГрафики.ДатаГрафика >= НАЧАЛОПЕРИОДА(БазаОтчета.ДатаРемонта, ДЕНЬ))
	|			И (КалендарныеГрафики.ДатаГрафика <= НАЧАЛОПЕРИОДА(БазаОтчета.ДатаОкончания, ДЕНЬ))
	|ГДЕ
	|	БазаОтчета.Смета ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	БазаОтчета.ОбъектРемонтныхРабот,
	|	БазаОтчета.ВидРемонтныхРабот,
	|	КалендарныеГрафики.ДатаГрафика,
	|	торо_РемонтыТрудовыеЗатраты.Квалификация,
	|	торо_РемонтыТрудовыеЗатраты.Количество,
	|	НАЧАЛОПЕРИОДА(КалендарныеГрафики.ДатаГрафика, МЕСЯЦ),
	|	торо_РемонтыТрудовыеЗатраты.Количество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БазаОтчета.ОбъектРемонтныхРабот,
	|	БазаОтчета.ВидРемонтныхРабот,
	|	КалендарныеГрафики.ДатаГрафика,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество,
	|	НАЧАЛОПЕРИОДА(КалендарныеГрафики.ДатаГрафика, МЕСЯЦ),
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество,
	|	СУММА(торо_ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы * торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество / БазаОтчета.КоличествоДней)
	|ИЗ
	|	ВТ_КалендарныеГрафики КАК КалендарныеГрафики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазаОтчета КАК БазаОтчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК торо_ЗаявкаНаРемонтТрудовыеЗатраты
	|			ПО БазаОтчета.Смета = торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
	|				И БазаОтчета.ID = торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
	|		ПО (БазаОтчета.ГрафикРемонтныхРабот = КалендарныеГрафики.Календарь)
	|			И (КалендарныеГрафики.ДатаГрафика >= НАЧАЛОПЕРИОДА(БазаОтчета.ДатаРемонта, ДЕНЬ))
	|			И (КалендарныеГрафики.ДатаГрафика <= НАЧАЛОПЕРИОДА(БазаОтчета.ДатаОкончания, ДЕНЬ))
	|ГДЕ
	|	НЕ БазаОтчета.Смета ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	БазаОтчета.ОбъектРемонтныхРабот,
	|	БазаОтчета.ВидРемонтныхРабот,
	|	КалендарныеГрафики.ДатаГрафика,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество,
	|	НАЧАЛОПЕРИОДА(КалендарныеГрафики.ДатаГрафика, МЕСЯЦ),
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.Объект,
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований.ВидРемонтныхРабот,
	|	КалендарныеГрафики.ДатаГрафика,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Квалификация,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество,
	|	НАЧАЛОПЕРИОДА(КалендарныеГрафики.ДатаГрафика, МЕСЯЦ),
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество,
	|	торо_ЗаявкаНаРемонтТрудовыеЗатраты.ВремяРаботы * торо_ЗаявкаНаРемонтТрудовыеЗатраты.Количество / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаРемонта, ДЕНЬ), КОНЕЦПЕРИОДА(СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаОкончания, ДЕНЬ), ДЕНЬ) + 1)
	|ИЗ
	|	СписокЗаявокНаОснованииДефектовИВнешнихОснований КАК СписокЗаявокНаОснованииДефектовИВнешнихОснований
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КалендарныеГрафики КАК КалендарныеГрафики
	|		ПО СписокЗаявокНаОснованииДефектовИВнешнихОснований.Объект.ПлановыйГрафикРаботы = КалендарныеГрафики.Календарь
	|			И (КалендарныеГрафики.ДатаГрафика >= НАЧАЛОПЕРИОДА(СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаРемонта, ДЕНЬ))
	|			И (КалендарныеГрафики.ДатаГрафика <= НАЧАЛОПЕРИОДА(СписокЗаявокНаОснованииДефектовИВнешнихОснований.ДатаОкончания, ДЕНЬ))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК торо_ЗаявкаНаРемонтТрудовыеЗатраты
	|		ПО СписокЗаявокНаОснованииДефектовИВнешнихОснований.Смета = торо_ЗаявкаНаРемонтТрудовыеЗатраты.Ссылка
	|			И СписокЗаявокНаОснованииДефектовИВнешнихОснований.ID = торо_ЗаявкаНаРемонтТрудовыеЗатраты.РемонтыОборудования_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабМТО.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ТабМТО.ВидРемонта КАК ВидРемонта,
	|	ТабМТО.Номенклатура КАК Номенклатура,
	|	ТабМТО.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабМТО.Период, ДЕНЬ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабМТО.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабМТО.Период, ГОД)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабМТО.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабМТО.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабМТО.Период, ДЕКАДА)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабМТО.Период, ПОЛУГОДИЕ)
	|	КОНЕЦ КАК Период,
	|	NULL КАК МаксимальнаяПотребностьИнструменты,
	|	NULL КАК НормативныйРемонтИнструменты,
	|	ТабМТО.Сумма КАК Сумма,
	|	ТабМТО.Количество КАК Количество,
	|	0 КАК Инструмент,
	|	0 КАК Квалификация,
	|	NULL КАК ВремяРаботы
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ТабМТО КАК ТабМТО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабИнструментов.ОбъектРемонтныхРабот,
	|	ТабИнструментов.ВидРемонтныхРабот,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабИнструментов.Дата, ДЕНЬ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабИнструментов.Дата, МЕСЯЦ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабИнструментов.Дата, ГОД)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабИнструментов.Дата, КВАРТАЛ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабИнструментов.Дата, НЕДЕЛЯ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабИнструментов.Дата, ДЕКАДА)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабИнструментов.Дата, ПОЛУГОДИЕ)
	|	КОНЕЦ,
	|	ТабИнструментов.МаксимальнаяПотребностьИнструменты,
	|	ТабИнструментов.НормативныйРемонтИнструменты,
	|	NULL,
	|	NULL,
	|	ТабИнструментов.Инструмент,
	|	0,
	|	NULL
	|ИЗ
	|	ТабИнструментов КАК ТабИнструментов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабСотрудников.ОбъектРемонтныхРабот,
	|	ТабСотрудников.ВидРемонтныхРабот,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабСотрудников.Дата, ДЕНЬ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабСотрудников.Дата, МЕСЯЦ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабСотрудников.Дата, ГОД)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабСотрудников.Дата, КВАРТАЛ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабСотрудников.Дата, НЕДЕЛЯ)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабСотрудников.Дата, ДЕКАДА)
	|		КОГДА &Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТабСотрудников.Дата, ПОЛУГОДИЕ)
	|	КОНЕЦ,
	|	ТабСотрудников.МаксимальнаяПотребностьСотрудники,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	ТабСотрудников.Квалификация,
	|	ТабСотрудников.ВремяРаботы
	|ИЗ
	|	ТабСотрудников КАК ТабСотрудников"

	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ЗапросТекст;

КонецФункции
